<?php

return [
    'required' => 'حقل :attribute مطلوب ولا يمكن تركه فارغاً.',
    'string' => 'حقل :attribute يجب أن يكون نصاً.',
    'email' => 'يرجى إدخال بريد إلكتروني صحيح.',
    'max' => [
        'string' => 'حقل :attribute يجب ألا يتجاوز :max حرفاً.',
    ],
    'min' => [
        'string' => 'حقل :attribute يجب أن يكون على الأقل :min حرفاً.',
    ],
    'unique' => 'هذا :attribute مسجل مسبقاً. يرجى استخدام :attribute آخر أو تسجيل الدخول.',
    'confirmed' => 'تأكيد كلمة المرور لا يتطابق مع كلمة المرور.',
    'current_password' => 'كلمة المرور الحالية غير صحيحة.',
    'lowercase' => 'حقل :attribute يجب أن يحتوي على أحرف صغيرة فقط.',
    'password' => [
        'mixed' => 'كلمة المرور يجب أن تحتوي على حرف كبير وحرف صغير على الأقل.',
        'letters' => 'كلمة المرور يجب أن تحتوي على حرف واحد على الأقل.',
        'symbols' => 'كلمة المرور يجب أن تحتوي على رمز واحد على الأقل.',
        'numbers' => 'كلمة المرور يجب أن تحتوي على رقم واحد على الأقل.',
        'uncompromised' => 'كلمة المرور التي أدخلتها ظهرت في تسريبات بيانات. يرجى اختيار كلمة مرور مختلفة.',
    ],

    'attributes' => [
        'name' => 'الاسم الكامل',
        'email' => 'البريد الإلكتروني',
        'password' => 'كلمة المرور',
        'password_confirmation' => 'تأكيد كلمة المرور',
    ],
];
